/*
* ファイル：Bullet C#
* システム：弾を制御する関数
* 
* Created by 寺門 冴羽
* 2025年 一部変更
*/

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Bullet : Attack
{
    //----------------------------------------------------------------------------------------------------------------------------
    // 変数宣言
    //----------------------------------------------------------------------------------------------------------------------------

    [SerializeField]
    float MoveSpeed;     // 移動速度


    //----------------------------------------------------------------------------------------------------------------------------
    // メイン関数
    //----------------------------------------------------------------------------------------------------------------------------

    // 最初のフレームの処理
    void Start()
    {
        // 直進する関数を呼び出す
        StraightMove(MoveSpeed);
    }


    //----------------------------------------------------------------------------------------------------------------------------
    // イベント関数
    //----------------------------------------------------------------------------------------------------------------------------

    private new void OnTriggerEnter2D(Collider2D collision)
    {
        // ベースの処理を呼ぶ
        base.OnTriggerEnter2D(collision);

        // プレイヤーに当たってたら処理する
        if (collision.gameObject.tag == "Player")
        {
            // 自分を消す
            Destroy(gameObject);
        }

        // 敵にダメージが与えられるか判定
        if (canEnemyDamage)
        {
            // 敵にあたっていたら処理する
            if (collision.gameObject.tag == "Enemy")
            {
                // 自分を消す
                Destroy(gameObject);
            }
        }
    }
}

