/*
* ファイル：Meteor C#
* システム：メテオの処理
* 
* Created by 寺門 冴羽
* 2025年 一部変更
*/

using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Meteor : Attack
{
    //----------------------------------------------------------------------------------------------------------------------------
    // 変数宣言
    //----------------------------------------------------------------------------------------------------------------------------

    [SerializeField]
    float destroyTime;    // 消えるまでの時間
    float destroyTimer;   // 消えるまでの時間のタイマー


    //----------------------------------------------------------------------------------------------------------------------------
    // メイン関数
    //----------------------------------------------------------------------------------------------------------------------------

    // 最初のフレームの処理
    void Start()
    {
        // 初期化
        destroyTimer = 0.0f;
    }

    // 毎フレームの処理
    void Update()
    {
        // 生成されてからの時間を計測
        destroyTimer += Time.deltaTime;

        // 消滅までの時間を超えてたら
        if (destroyTimer >= destroyTime)
        {
            // 消滅
            Destroy(gameObject);
        }
    }
}